//=============================================================================
//
// ゲームクリア処理 [GameClear.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _GAMECLEAR_H_
#define _GAMECLEAR_H_

//*****************************************************************************
//ヘッダファイルのインクルード
//*****************************************************************************
#include "mode.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CGameClear :public CMode
{
public:
	CGameClear();
	~CGameClear();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	int m_nSelectCounter;
};

#endif