//=============================================================================
//
// メイン処理 [main.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>
#include <d3dx9.h>
#define DIRECTINPUT_VERSION (0x0800)	// 警告対処用("dinput.h"の直前に定義)
#include <dinput.h>

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")
#pragma comment(lib, "dxguid.lib")
#pragma comment(lib, "winmm.lib")
#pragma comment(lib, "dinput8.lib")		// 入力処理に必要

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CManager;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)	// 頂点フォーマット(頂点座標[2D]/頂点カラー/テクスチャ座標)
#define SCREEN_WIDTH (1280)												// ウインドウの幅
#define SCREEN_HEIGHT (720)												// ウインドウの高さ
#define WALL_SIZE_X (128.0f)											//壁のXサイズ
#define WALL_SIZE_Y (720.0f)											//壁のYサイズ
#define FLOOR_SIZE_X (1280.0f)											//床のXサイズ
#define FLOOR_SIZE_Y (72.0f)											//床のYサイズ

#ifdef _DEBUG
#undef _DEBUG
#endif

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
CManager *GetManager(void);
int GetFPS(void);

#endif