//=============================================================================
//
// タッチナンバーゲームの通信プロトコル定義 [protocol_ranking.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _PROTOCOL_RANKING_H_
#define _PROTOCOL_RANKING_H_

//=============================================================================
// ■ 通信プロトコルデータフォーマット ■
// ・ランキング一覧取得
// ・ランキング設定
//=============================================================================

//=============================================================================
// ■■ ランキング一覧取得 ■■
// 
// ■■■ [Client -> Server] ■■■
// [1バイト目] コマンド (COMMAND_TYPE_GET_RANKING)
// 
// ■■■ [Client <- Server] ■■■
// [1バイト目～4バイト目] ランキング1位のクリア時間 (単位:msec)
// [5バイト目～12バイト目] ランキング1位の名前
// [13バイト目～16バイト目] ランキング2位のクリア時間 (単位:msec)
// [17バイト目～24バイト目] ランキング2位の名前
// …
// [109バイト目～112バイト目] ランキング10位のクリア時間 (単位:msec)
// [113バイト目～120バイト目] ランキング10位の名前
// ※ランキング未登録時はクリア時間 0 を返す
//=============================================================================
//=============================================================================
// ■■ ランキング設定 ■■
// 
// ■■■ [Client -> Server] ■■■
// [1バイト目] コマンド (COMMAND_TYPE_SET_RANKING)
// [2バイト目～5バイト目] クリア時間 (単位:msec)
// [6バイト目～13バイト目] 名前
// 
// ■■■ [Client <- Server] ■■■
// [1バイト目] ランクインした場合は順位、それ以外は 0
//=============================================================================

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_RANKING (10)				// ランキングデータ数
#define MAX_NAME (8)					// 名前サイズ

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct
{
	int nScore;
	//char aName[MAX_NAME];
} RankingData;

//*****************************************************************************
// 列挙型宣言
//*****************************************************************************
typedef enum
{
	COMMAND_TYPE_NONE = 0,
	COMMAND_TYPE_GET_RANKING,		// ランキング一覧を取得
	COMMAND_TYPE_SET_RANKING		// ランキングを設定
} COMMAND_TYPE;

#endif